---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidSketchForBuildingpad
source: html/02e833ce-38f7-3008-dc82-ee3d42ee77e7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidSketchForBuildingpad Property

Pad sketch is invalid.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidSketchForBuildingpad { get; }
```